print('Здравствуйте, студент, введите курс, на котором вы обучаетесь. (числа от 1 до 4)')
x = int(input())
if x == 4:
    print('Здравствуй, четверокурсник')
    print('Данная программа поможет тебе узнать, прошел ли ты промежуточную аттестацию')
if x == 3
    print('Здравствуй, третьекурсник')
    print('Данная программа поможет тебе узнать, прошел ли ты промежуточную аттестацию и перешел ли на следующий курс/семестр')
if x == 2
    print('Здравствуй, второкурсник')
    print('Данная программа поможет тебе узнать, прошел ли ты промежуточную аттестацию и перешел ли на следующий курс/семестр')
if x == 1
    print('Здравствуй, первокурсник')
    print('Данная программа поможет тебе узнать, прошел ли ты промежуточную аттестацию и перешел ли на следующий курс/семестр')